Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་དག་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they offer the Tathāgata flowers of various colors, consider those bodhisattvas to be on the third bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་དག་གིས་འཐོར་བར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they scatter flowers on the Tathāgata, consider those bodhisattvas to be on the fourth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཕྱག་ཏུ་ལག་པས་མེ་ཏོག་འབུལ་བར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་བར་བལྟའོ། །
en: If the bodhisattvas offer flowers from their hand to the hand of the Tathāgata, consider those bodhisattvas to be on the fifth bhūmi.

source: གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་ལྷའི་མེ་ཏོག་དག་འབུལ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟ་སྟེ།
en: If they offer the Tathāgata divine flowers, consider those bodhisattvas to be on the sixth bhūmi.

source: བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །གང་ཟག་གཉིས་པོ་ལས་དང་པོ་པ་དང་། སོམ་ཉི་ཅན་ཡང་མ་གཏོགས་སོ། །
en: These are the signs unless they are the activity of Māra, or if they occur for two types of people: beginners and those with doubts.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རི་ལ་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་དེས་ནི་འགྱོད་པ་བསྐྱེད་པ་དང་། ཆོས་སྤངས་པ་ཡིན་ཏེ།
en: 41. “Vajrapramardin, if in a dream bodhisattvas perceive themselves on a mountain, they have experienced remorse and forsaken the Dharma.

source: ལས་ཀྱི་སྒྲིབ་པ་ཆེ་བ་དང་། ནད་མང་བ་དང་། ཤེས་རབ་ཆུང་བར་ཡང་འགྱུར་རོ། །
en: They will have major karmic obscurations, many illnesses, and be of limited insight.

source: གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་ཡིད་ཀྱིས་བརྩོན་པར་བྱས་ན་དེས་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་ཏེ།
en: If they exert themselves without hostility toward any being, they will find release in awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་འདི་ནི་ས་ལྔ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: Consider such bodhisattvas to be on one of the first five bhūmis.

source: དེས་ལོ་བདུན་དུ་ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལ་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་གདོན་པར་བྱ་ཞིང་ས་དང་པོ་ལ་ཡེ་ཤེས་སྣང་བ་ལ་བརྩོན་པ་རྣམས་ལ་བདེ་བའི་བསྙེན་བཀུར་ཉེ་བར་བསྒྲུབ་པར་བྱའོ། །
en: They should recite the Three Sections Dharma discourse three times a day and three times a night for seven years. “While on the first bhūmi they should render joyful service to those who strive for the light of wisdom.

source: ས་གཉིས་པ་ལ་ནི་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱའོ། །
en: While on the second bhūmi they should offer reverence and service.

source: ས་གསུམ་པ་ལ་ནི་དཀོན་མཆོག་གསུམ་ལ་མཆོད་པ་བྱའོ། །
en: While on the third bhūmi they should make offerings to the Three Jewels.

source: ས་བཞི་བ་ལ་ནི་ཆོས་ཟབ་མོ་དག་ལ་བཟོད་པ་བསྒོམ་པར་བྱ་སྟེ།
en: While on the fourth bhūmi they should cultivate acceptance of the profound Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པོ་དག་ཏུ་བལྟའོ། །
en: Regard them as bodhisattvas on one of the first five bhūmis.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གཅེར་བུར་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་སྟེ།
en: 42. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be naked, consider such bodhisattvas to have minor karmic obscurations.

source: དེས་སྟོང་པ་ཉིད་ལ་བརྩོན་པར་བྱའོ། །
en: They should make an effort in realizing emptiness.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བཞི་པོ་དག་ཏུ་བལྟ་སྟེ།
en: Consider those bodhisattvas to be on one of the first four bhūmis.

source: གང་གིས་བདག་གཅེར་བུར་གྲོང་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བར་བལྟའོ། །
en: “If they perceive themselves to be naked in a city, consider those bodhisattvas to be on the first bhūmi.

source: གང་གིས་བདག་གཅེར་བུར་གྲོང་ཁྱེར་གྱི་དབུས་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they perceive themselves to be naked in the center of a city, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་བདག་གཅེར་བུར་དགོན་པ་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they perceive themselves to be naked in a wilderness, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་བདག་གཅེར་བུར་རི་ལ་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟ་སྟེ།
en: If they perceive themselves to be naked on a mountain, consider those bodhisattvas to be on the fourth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཕྱོགས་མཚམས་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན། གང་ཟག་དེ་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་སྤངས་པ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: 43. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be in an intermediate direction, consider such individuals to have been abandoned by their spiritual guide and to be on the first bhūmi.

source: དེ་ནི་བློ་ཆུང་བ་དང་། ལེ་ལོ་ཆེ་བ་དང་། སེམས་ལ་མྱ་ངན་མང་བ་དང་། གནོད་པ་མང་བ་དང་། སྐྱེ་བོ་མང་པོ་སྡང་བ་དང་། ནད་མང་བ་དང་། སེམས་གཡེང་བར་ཡང་འགྱུར་རོ། །
en: They will be of meager intelligence, profoundly lazy, experience much mental anguish and many harms, be hated by numerous people, have many diseases, and be distracted.

source: དགེ་བའི་རྩ་བ་དག་ལ་རབ་ཏུ་འབྱུང་བར་འགྱུར་ཞིང་ཕྱིར་ཡང་ལྡོག་པར་འགྱུར་རོ། །
en: They will renounce and turn from their roots of virtue.

source: ལོངས་སྤྱོད་དག་ཀྱང་ཚེགས་ཆེན་པོས་ཐོབ་པར་འགྱུར་ཞིང་ཉོན་མོངས་པ་མང་པོར་ཡང་འགྱུར་རོ། །
en: They will acquire material necessities only with great difficulty and will have many afflictions.

source: དེས་ནི་རྙེད་པའི་ཕྱིར་ཆོས་སྨྲ་བ་ལ་སྨད་ཅིང་ཆོས་ཀྱང་སྤངས་ལ་མ་དད་པ་དང་། མ་མོས་པ་དང་། ངོ་ཚ་མེད་པས་ཆོས་སྨྲ་བ་ལ་བསྙེན་བཀུར་བྱས་པ་ཡིན་བས་དེས་དྲང་པོས་ཆོས་སྨྲ་བ་ལ་བསྟེན་པར་བྱའོ། །
en: Because those bodhisattvas have, for the sake of profit, denigrated Dharma teachers and even forsaken the Dharma, and because they have served Dharma teachers while being faithless, irreverent, and shameless, they should rely on Dharma teachers with sincerity.

source: དེས་གལ་ཏེ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་ཀྱིས་རྫས་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་གྱུར་ན། དེས་ན་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་ཏེ།
en: If they renounce all material things without any hostility, they will find release in awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པའི་བར་དག་ལ་ཡང་རེག་པར་འགྱུར་བས། དེས་ཀྱང་སྐྱོན་ཆུང་ངུ་དང་། འབྲིང་དང་། ཆེན་པོ་དེ་དག་གཞོམ་པ་ལ་བརྩོན་པར་བྱའོ། །
en: Such bodhisattvas will reach the first six bhūmis, and so should exert themselves in eradicating their minor, middling, and major faults.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་སྔོན་མ་མཐོང་བའི་ཡུལ་དུ་ཕྱིན་པར་ཀུན་ཏུ་ཤེས་ན། དེ་ལ་བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་དག་ཡོད་པ་ཡིན་པས་དེས་རྟོགས་ནས་བརྩོན་པར་བྱས་ན་རྣམ་པར་དག་པར་འགྱུར་རོ། །
en: 44. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to have gone to a region they have never visited before, they are under the influence of Māra and have karmic obscurations. They will be purified if they realize this and exert themselves.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: Consider such bodhisattvas to be on one of the first three bhūmis.

source: དཀོན་མཆོག་གསུམ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ལ་བརྩོན་པས་ནི་ས་དང་པོ་ལ་སྦྱོར་བར་འགྱུར་རོ། །
en: “They will arrive at the first bhūmi by diligently creating roots of virtue in the name of the Three Jewels.

source: སྟོང་པ་ཉིད་སྒོམ་པས་ནི་ས་གཉིས་པ་ལ་སྦྱོར་བར་འགྱུར་རོ། །
en: They will arrive at the second bhūmi by cultivating emptiness.

source: ཆོས་ལ་བཟོད་པས་ནི་ས་གསུམ་པ་ལ་སྦྱོར་བར་འགྱུར་རོ། །
en: They will arrive at the third bhūmi by accepting phenomena.

source: གལ་ཏེ་ས་དྲུག་པའི་བར་དག་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཚན་མ་དེ་དག་བྱུང་བར་གྱུར་ན་བདུད་ཀྱི་ལས་སུ་རྟོགས་པར་བྱའི་ལས་ཀྱི་སྒྲིབ་པ་ནི་མ་ཡིན་ནོ། །
en: When these signs appear to bodhisattvas residing on one of the first six bhūmis, they should be understood as the activity of Māra rather than karmic obscurations.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཆུ་བོའི་ནང་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། དེ་ལ་ནི་མི་དགེ་བའི་ཆོས་དང་། དགེ་བའི་ཆོས་གཉིས་ཀ་ཡང་ཤས་ཆེ་བ་ཡིན་ནོ། །
en: 45. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be in a river, consider those bodhisattvas to be on one of the first five bhūmis. They have substantial amounts of both nonvirtuous and virtuous qualities.

source: དེ་གལ་ཏེ་སྲོག་ཡོངས་སུ་གཏོང་བས་ཡོངས་སུ་གདུང་བར་མི་འགྱུར་ཞིང་སྡིག་པའི་གྲོགས་པོ་ཡང་ཡོངས་སུ་སྤོང་བར་བྱེད་ལ། གཡོ་མེད་པས་ཆོས་ལ་མོས་པའི་གང་ཟག་ལ་བསྟེན་པར་བྱེད་ན་དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །
en: They will purify their related karmic obscurations if they do not feel anguish about forsaking their life, if they shun evil companions, and if they unhesitatingly rely on people who respect the Dharma.

source: དེ་ནི་གནོད་པ་དང་རྩུབ་པའི་སེམས་ཀྱིས་ཆོས་གནས་པར་བྱ་བའི་ཕྱིར་དགེ་བའི་བཤེས་གཉེན་དག་ལ་བསྟེན་པ་ཡིན་ནོ། །
en: They rely on a spiritual guide so that they can sustain their Dharma practice with their malicious, coarse minds.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་བདག་ཆུ་བོ་འཁྲུགས་པའི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If bodhisattvas perceive themselves entering a raging river, consider those bodhisattvas to be on the first bhūmi.

source: གང་གིས་བདག་ཆུ་བོ་དབུ་བ་ཅན་གྱི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they perceive themselves entering a river with foam, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་བདག་ཆུ་བོ་དབའ་རླབས་ཆེན་པོའི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they perceive themselves entering a river with large waves, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་བདག་ཆུ་བོའི་ཀློང་འཁྱིལ་པའི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they perceive themselves entering a river’s eddies, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་བདག་ཆུ་བོ་རབ་ཏུ་དང་བའི་ནང་དུ་སོང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they perceive themselves entering a clear river, consider those bodhisattvas to be on the fifth bhūmi. 46.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྤྲིན་ལས་ཆར་འབབ་པར་མཐོང་ན་དེ་ལ་བདུད་ཀྱི་ལས་མང་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas see rain falling from the clouds, they are significantly influenced by the activity of Māra.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟའོ། །
en: Consider those bodhisattvas be on any of the first seven bhūmis.

source: དེས་ནི་དབང་ཕྱུག་དང་ལྡན་བ་ན་ཆོས་སྨྲ་བ་དག་ལ་ཐོ་བརྩམས་ཤིང་རབ་ཏུ་བྱུང་ནས་ཀྱང་རྙེད་པ་དང་། བཀུར་སྟིས་ཟིལ་གྱིས་ནོན་པས་ཆོས་སྨྲ་བ་དག་ལ་བསྔགས་པ་མ་ཡིན་པ་བརྗོད་ལ།
en: When rich and powerful, such bodhisattvas brought ruin to Dharma teachers; after renouncing, they were overcome by profit and honor and so made unflattering statements about Dharma teachers and gave mistaken advice to diligent people.

source: མངོན་པར་བརྩོན་པ་རྣམས་ལ་ཡང་གདམས་ངག་ལོག་པར་སྨྲས་པ་ཡིན་པས་དེས་བཟོད་པ་ལྷུར་བླང་བ་དང་། ཐོས་པ་ལ་བརྩོན་པར་བྱ་བ་དང་། རྙེད་པ་དང་།
en: Thus, those bodhisattvas should focus on being patient, strive to listen, and end their obsession with profit and honor.

source: བཀུར་སྟི་ལ་ལྷག་པར་ཆགས་པ་མེད་པར་བྱ་ཞིང་གལ་ཏེ་གཞན་ལ་ཕན་པ་ལ་ཤིན་ཏུ་བརྩོན་པར་བྱས་ན་དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་འབྱང་བར་འགྱུར་རོ། །
en: If they dedicate their efforts to benefiting others, they will purify their related karmic obscurations.

source: དེ་ལ་གང་གིས་རྡུལ་གྱིས་ཡོག་པའི་སྤྲིན་ལས་ཆར་འབབ་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they see rain falling from clouds shrouded in dust, consider those bodhisattvas to be on the first bhūmi.

source: གང་གིས་རླུང་གིས་འཁྲུགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see it stirred up by the wind, consider those bodhisattvas to be on the second bhūmi.

source: གང་གིས་སྤྲིན་གྱིས་འཁྲུགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see it stirred up by the clouds, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་འབྲུག་གྲག་པའི་སྤྲིན་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see thundering clouds, consider those bodhisattvas to be on the fourth bhūmi.

source: གང་གིས་གློག་གིས་དངངས་པར་བྱེད་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see clouds emitting lightning, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་གིས་ཐོག་འབབ་པ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see lightning strike, consider those bodhisattvas to be on the sixth bhūmi.

source: གང་གིས་ཆར་ཆུའི་རྒྱུན་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟ་སྟེ།
en: If they see torrents of rain, consider those bodhisattvas to be on the seventh bhūmi.

source: ས་དང་ས་དག་ལ་བདུད་ཀྱི་ལས་ནི་ཤེས་པར་བྱའོ། །
en: Know that the signs for any of the bhūmis may be the activities of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ས་གཡོས་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟ་སྟེ།
en: 47. “Vajrapramardin, if in a dream bodhisattvas witness an earthquake, consider those bodhisattvas to be on the first bhūmi.

source: ལས་དང་པོ་བ་དམིགས་པ་ལ་མང་དུ་སྤྱོད་པ་ཡིན་ཞིང་དེ་ལ་ནི་བདུད་ཀྱི་ལས་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཡང་ཤས་ཆེ་བ་ཡིན་ཏེ།
en: When such bodhisattvas were just beginning, they were often caught up in conceptual reference points, thus for them both the influence of Māra and karmic obscurations are substantial.

source: སེམས་ཅན་མང་པོ་འཇིགས་པར་བྱས་པ་ཡིན་པས། དེས་གལ་ཏེ་སེམས་ཅན་རྣམས་ལ་མི་འཇིགས་པའི་སྦྱིན་པ་བྱིན་ཞིང་རྣམ་པ་གསུམ་བསྡམས་པར་གྱུར་ན་དེ་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་རོ། །
en: Because they instilled fear in many beings, they can purify the related karmic obscurations if they give beings the gift of fearlessness and restrain the three aspects.

source: དེ་ལ་ཡང་དང་ཡང་དུ་ས་གཡོ་བར་མཐོང་ན་དེ་ནི་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྟེ། ས་དང་པོ་པར་བལྟའོ། །
en: “If they see the earth quake repeatedly, consider those bodhisattvas to be beginners on the first bhūmi.

source: གྲོང་ཁྱེར་ཞིག་པ་འམ། ལྗོངས་ཀྱི་མི་ཀུན་ཏུ་འཁྲུགས་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see a city destroyed or the population in chaos, consider those bodhisattvas to be on the second bhūmi.

source: ཡུན་རིང་དུ་གཡོ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they see a quake that lasts a long time, consider those bodhisattvas to be on the third bhūmi.

source: བདེན་པའི་བྱིན་གྱི་རླབས་ཀྱིས་གཡོ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they see the earth quake because of an act of truth, consider those bodhisattvas to be on the fourth bhūmi.

source: བདུད་ཀྱི་ལས་ཀྱིས་གཡོ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they see the earth quake because of the activity of Māra, consider those bodhisattvas to be on the fifth bhūmi.

source: གཡོ་བས་མཐོ་འཚམ་པར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they see an earthquake that causes injuries, consider those bodhisattvas to be on the sixth bhūmi.

source: གཟུངས་ལ་བརྩོན་པས་གཡོ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they see the earth quake from the use of dhāraṇīs, consider those bodhisattvas to be on the seventh bhūmi.

source: གཡོས་ནས་དབང་ཐང་ཆེ་བར་གྲགས་པའི་ལྷ་རྣམས་འདུ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པར་བལྟའོ། །
en: If they see the most exalted of gods assemble after an earthquake, consider those bodhisattvas to be on the eighth bhūmi.

source: གཡོས་ནས་ཀླུ་དང་ཚངས་པས་གཟི་བྱིན་སྐྱེད་པར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དགུ་པར་བལྟའོ། །
en: If they see the radiant glow of the nāgas and Brahmā following an earthquake, consider those bodhisattvas to be on the ninth bhūmi.

source: ས་གཡོས་ནས་དེ་བཞིན་གཤེགས་པའི་སྒྲ་ཐོས་སམ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བཅུ་པར་བལྟ་སྟེ།
en: If, following an earthquake, they see or hear the voice of the Tathāgata, consider those bodhisattvas to be on the tenth bhūmi.

source: ས་དང་ས་དག་ལ་དེ་ལྟར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Thus, take to heart the signs for each of the bhūmis.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གཡུལ་འགྱེད་པའི་ནང་དུ་སོན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བཞི་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: 48. “Vajrapramardin, if in a dream bodhisattvas perceive themselves in the midst of battle, consider those bodhisattvas to be on one of the first four bhūmis.

source: ས་གོང་མས་བདུན་པ་མན་ཅད་ལ་མི་བརྩོན་པ་དག་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་འབྱུང་ངོ་། །
en: For those who do not make a concerted effort on the seven lower bhūmis, these signs are the work of Māra.

source: དེ་ནི་ཆོས་མ་ཡིན་པ་སྨྲ་བ་དག་ཡོངས་སུ་བཟུང་ཞིང་རྙེད་པ་དང་། བཀུར་སྟི་ལ་ལྷག་པར་ཆགས་པས་ཆོས་སྨྲ་བ་དག་ཡོངས་སུ་སྤངས་ལ་དེ་ལ་དེས་ཆོས་སྨྲ་བ་དག་ལ་གཡོས་བསྙེན་བཀུར་བྱས་པ་ཡིན་པས།
en: Such bodhisattvas followed teachers who taught what is not Dharma, and, out of an obsession with profit and honor, shunned teachers of the Dharma or served them deceptively.

source: དེས་གལ་ཏེ་ཐབས་མཁས་པ་ལ་བསླབས་ཤིང་ལྷག་པའི་བསམ་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ལ་སྤྱད་ན། དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: Those bodhisattvas will purify their karmic obscurations and find release in awakening if they train in skillful methods and practice the perfections with utmost sincerity.

source: དེ་ལ་བདག་གང་ན་གནས་པར་གཡུལ་འགྱེད་པ་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If bodhisattvas see a battle where they live, consider them to be on the first bhūmi.

source: མཚོན་ཆ་འདེབས་པར་མཐོང་ནས་གཉིས་པར་བལྟའོ། །
en: If they see weapons flying, consider them to be on the second bhūmi.

source: བོང་བ་དང་དབྱུག་པ་འབབ་པར་མཐོང་ན་ས་གསུམ་པར་བལྟའོ། །
en: If they see a rain of earth and sticks, consider them to be on the third bhūmi.

source: གཤེ་བ་དང་བརྒྱད་བཀག་པ་མཐོང་ན་ས་བཞི་པར་བལྟ་སྟེ།
en: If they see people reviling and rebuking each other, consider them to be on the fourth bhūmi.

source: མི་བརྩོན་པ་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་རིག་པར་བྱའོ། །
en: For those who put forth no effort, these signs are the work of Māra. 49.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ན་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གཉིས་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟའོ། །
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be ill, consider those bodhisattvas to be on the first or second bhūmi.

source: དེ་ལ་ནི་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་བྱ་བ་ཐམས་ཅད་ལ་བར་ཆད་མང་བ་ཡིན་ནོ། །
en: They have numerous hindrances to all their worldly and spiritual activities.

source: དེས་ནི་ཆོས་ཀྱིས་ཀུན་ཏུ་བསྡུ་བ་བྱས་ནས་ཡང་ཕྱིར་བཤིག་པ་དང་། ཡོ་བྱད་དག་བྱིན་ནས་ཡང་ཕྱིར་ཕྲོགས་པ་ཡིན་པས།
en: What they gathered through the Dharma they later split apart, and the material goods they once offered they later took back.

source: དེས་གལ་ཏེ་ཆོས་སྨྲ་བའི་གང་ཟག་རྣམས་ལ་ཇི་ལྟར་འོས་པའི་མཆོད་པ་དག་ཕུལ་ཞིང་ཞེ་འགྲས་པ་མེད་པའི་སེམས་ཀྱིས་འབུལ་བར་བྱེད་ན། དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: Their karmic obscurations will be purified and they will find release in awakening if they present any suitable offering to people who teach the Dharma and make those offerings with a mind free of hostility.

source: ས་གཞན་ལ་གནས་པ་དག་གིས་བདག་ན་བར་ཀུན་ཏུ་ཤེས་ན་དེས་ནི་བདུད་ཀྱི་ལས་སུ་རྟོགས་པར་བྱའོ། །
en: When those residing on other bhūmis perceive themselves to be ill in a dream, they should understand this to be the work of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གཡང་ས་ནས་གཡང་དུ་ལྷུང་ཞིང་རྟོན་པ་མེད་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སྔོན་གྱི་མཐར་བསམ་པ་ཉམས་པར་གྱུར་ཅིང་ཤིན་ཏུ་གཡོན་ཅན་དང་། མ་མོས་པ་མང་བ་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་མང་བ་དང་། བདུད་ཀྱི་ལས་མང་བ་དང་། ལུས་ཉམ་ཆུང་བ་དང་། སེམས་ཞན་པ་ཡིན་ཏེ།
en: 50. “Vajrapramardin, if in a dream bodhisattvas perceive themselves falling off a precipice into an abyss and are unable to catch hold, it indicates that in the past those bodhisattvas’ intentions were corrupted. It shows they are deceitful, frequently disrespectful, always have numerous karmic obscurations, are significantly influenced by Māra, and are physically feeble and mentally weak.

source: དེ་ལ་ནི་ཆོས་ཀྱི་ལུང་ཕོག་ན་མྱུར་དུ་མཐོང་ཞིང་འདུན་པ་སྐྱེས་ནས་ཀྱང་ཡང་ཕྱིར་ནུར་བར་འགྱུར་ཞིང་དེ་ནི་སྦྱིན་པ་སྦྱིན་ན་ཡང་འགྱོད་པ་དང་བཅས་པས་སྦྱིན་པར་འགྱུར་ལ།
en: When they receive Dharma instruction, they quickly see their import and feel inspired, but it later fades away.

source: བྱིན་ནས་ཀྱང་སོམ་ཉིར་འགྱུར་བ་དང་།
en: When giving gifts, they do so with a sense of regret and feel doubt about it afterward.

source: ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་སྨྲ་ན་ཡང་ནུར་བར་འགྱུར་ཏེ།
en: Anything they say that accords with the Dharma will fade away.

source: དེས་ལོངས་སྤྱོད་རྒུད་པར་མཐོང་བ་དང་། དེས་བསྟན་པ་རྒུད་པར་མཐོང་བ་དང་། དེས་བཟོད་པ་རྒུད་པ་མཐོང་བ་དང་། དེ་དམིགས་པ་མང་བར་འགྱུར་བ་དང་། ཆོས་མ་ཡིན་པ་སྨྲ་བ་གང་ཡིན་པ་ལ་སྟེན་པ་དང་། ཟབ་མོ་ལ་མོས་པའི་གང་ཟག་རྣམས་ལ་མོས་པ་མ་ཡིན་པ་མང་དུ་འགྱུར་ཏེ།
en: Such bodhisattvas will frequently see their wealth and patience diminish, have many conceptual reference points, rely on those who teach what is not the Dharma, and not respect people who revere the profound.

source: གང་གིས་བདག་གཡང་ས་ནས་ལྷུང་ནས་མཚོན་ཆའི་ནང་དུ་སོན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If bodhisattvas perceive themselves falling from a precipice into swords, consider those bodhisattvas to be on the first bhūmi.

source: གང་གིས་བདག་བྲག་ལས་གཡང་དུ་ལྷུང་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they perceive themselves falling from a cliff into an abyss, consider those bodhisattvas to be on the second bhūmi.

source: ས་གཞན་ལ་གནས་པ་དག་ལ་ནི་ལས་ཀྱི་སྒྲིབ་པས་གཡང་དུ་ལྷུང་བས་ཀུན་ཏུ་ཤེས་པ་འབྱུང་གི་བདུད་ཀྱི་ལས་ཀྱིས་ནི་མ་ཡིན་ནོ། །
en: Those who reside on other bhūmis perceive themselves falling into a chasm due to karmic obscurations, not the work of Māra.

source: དེས་གལ་ཏེ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་འཇིག་རྟེན་དང་མི་འཐུན་པའི་སྦྱིན་པ་སྤྱད་པར་བྱས་ཤིང་ཤེས་པ་དང་ལྡན་པ་ཡང་མཆོད་ལ། ཞེ་འགྲས་པ་མེད་པའི་སེམས་སུ་ཡང་བྱས་ན། །དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་།
en: They will purify these karmic obscurations if they practice generosity that goes beyond worldly generosity three times a day and three times a night for three months, and if they make offerings to those with knowledge while maintaining an attitude free of hostility.

source: བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: Those bodhisattvas will also find release in awakening. 51.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས། རྨི་ལམ་ན་བདག་བསད་པ་ལས་ཐར་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ལ་བདུད་ཀྱི་ལས་མང་གི་ལས་ཀྱི་སྒྲིབ་པ་ནི་མེད་དོ། །
en: “Vajrapramardin, if in a dream bodhisattvas perceive that they are saved from being killed, they are significantly influenced by Māra but have no karmic obscurations.

source: དེས་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་བསྒོམ་པར་བྱ་ཞིང་བྱམས་པ་ལ་གནས་པར་ཡང་བྱ་སྟེ།
en: They should cultivate the samādhi of wishlessness and ground themselves in loving kindness.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ཏུ་བལྟའོ།
en: Consider such bodhisattvas to be on the any of the first six bhūmis.

source: གང་གིས་བདག་དགོན་པར་གསད་པ་ལས་ཐར་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: “If those bodhisattvas perceive that they are saved from being killed in the wilderness, consider them to be on the second bhūmi.

source: གང་གིས་བདག་གྲོང་གི་ཉེན་ཀོར་དུ་གསད་པ་ལས་ཐར་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they perceive that they are saved from being killed in the vicinity of a town, consider those bodhisattvas to be on the third bhūmi.

source: གང་གིས་བདག་ཉེ་དུའི་ནང་དུ་གསད་པ་ལས་ཐར་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they perceive that they are saved from being killed while among relatives, consider those bodhisattvas to be on the sixth bhūmi.

source: མི་བརྩོན་པ་དང་། ལས་དང་པོ་པ་དང་། ལྷག་པའི་བསམ་པ་ཉམ་ཆུང་བ་ལ་ནི་བྱང་ཆུབ་ལས་ཟློག་པའི་ཕྱིར་བདུད་ཀྱི་ལས་ཀྱང་འབྱུང་བར་འགྱུར་རོ། །
en: For those who make no effort, beginners, and those deficient in their determination, these signs are the work of Māra because they cause one to turn back from awakening.
